In [3]:
import pandas as pd

df = pd.read_csv("students_data.csv")
df.head()

      name  age   city  math_score  english_score
0    Ahmed   23  Cairo          85             80
1     Sara   21   Giza          92             89
2     Omar   25   Alex          78             75
3     Mona   22  Cairo          88             91
4  Youssef   24   Giza          90             87